package com.yunshuting.eightdiagrams

import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import com.bumptech.glide.Glide
import kotlinx.android.synthetic.main.activity_pinyin.*
import kotlinx.android.synthetic.main.gua_item_layout.view.*

class PinyinActivity : AppCompatActivity() {
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_pinyin)
        supportActionBar?.apply {
            title = "周易知识简介"
        }
    }

    override fun onResume() {
        super.onResume()
        showInfo()
    }

    private fun showInfo() {
        tv_info_bagua_gejue .text = "乾三连，坤六断；\n" +
                "震仰盂，艮覆碗；\n" +
                "离中虚，坎中满；\n" +
                "兑上缺，巽下断。"
        //分宫卦象次序歌
        tv_info_fengong.text ="乾为天，天风姤，天山遁，天地否，风地观，山地剥，火地晋，火天大有。\n" +
                "坎为水，水泽节，水雷屯，水火既济，泽火革，雷火丰，地火明夷，地水师。\n" +
                "艮为山，山火贲，山天大畜，山泽损，火泽睽，天泽履，风泽中孚，风山渐。\n" +
                "震为雷，雷地豫，雷水解，雷风恒；地风升，水风井，泽风大过，泽雷随。\n" +
                "巽为风，风天小畜，风火家人，风雷益，天雷无妄，火雷噬嗑，山雷颐，山风蛊。\n" +
                "离为火，火山旅，火风鼎，火水未济，山水蒙，风水涣，天水讼，天火同人。\n" +
                "坤为地，地雷复，地泽临，地天泰，雷天大壮，泽天夬，水天需，水地比。\n" +
                "兑为泽，泽水困，泽地萃，泽山咸，水山蹇，地山谦，雷山小过，雷泽归妹。"

        //上下经卦名次序歌
        tv_info_guaming.text ="乾坤屯蒙需讼师， 比小畜兮履泰否，\n" +
                "同人大有谦豫随， 蛊临观兮噬嗑贲，\n" +
                "剥复无妄大畜颐， 大过坎离三十备。\n" +
                "咸恒遁兮及大壮， 晋与明夷家人睽，\n" +
                "蹇解损益夬姤萃， 升困井革鼎震继，\n" +
                "艮渐归妹丰旅巽， 兑涣节兮中孚至，\n" +
                "小过既济兼未济， 是为下经三十四。"

        //上下经卦变歌
        tv_info_guabian.text ="讼自遁变泰归妹，否从渐来随三位。\n" +
                "首困噬嗑未济兼，蛊三变贲井既济。\n" +
                "噬嗑六五本益生，贲原于损既济会。\n" +
                "无妄讼来大畜需，咸旅恒丰皆疑似。\n" +
                "晋从观更睽有三，离与中孚家人系。\n" +
                "蹇利西南小过来，解升二卦相为赘。\n" +
                "鼎由巽变渐涣旅，涣自渐来终于是。"

        //分宫
        tv_info_shunxu.text ="1．乾卦： qián ；2．坤卦： kūn ；3．屯卦： zhūn；\n" +
                "\n" +
                "4．蒙卦： méng； 5．需卦： xū； 6．讼卦： sòng；\n" +
                "\n" +
                "7．师卦： shī； 8．比卦： bǐ； 9．小畜卦： xiǎo xǜ；\n" +
                "\n" +
                "10．履卦： lǚ； 11．泰卦： tài； 12．否卦： pǐ；\n" +
                "\n" +
                "13．同人卦：tóng rén； 14．大有卦： dà yǒu； 15．谦卦： qiān；\n" +
                "\n" +
                "16．豫卦： yù； 17．随卦： suí； 18．蛊卦： gǔ；\n" +
                "\n" +
                "19．临卦： lín； 20．观卦 guān； 21．噬嗑卦： shì hé；\n" +
                "\n" +
                "22．贲卦： bì； 23．剥卦： bō； 24．复卦： fù；\n" +
                "\n" +
                "25．无妄卦 wú wàng； 26．大畜卦： dà xù； 27．颐卦： yí；\n" +
                "\n" +
                "28．大过卦： dà guò； 29．坎卦： kǎn； 30．离卦： lí；\n" +
                "\n" +
                "31．咸卦： xián； 32．恒卦： héng； 33．遁卦： dùn；\n" +
                "\n" +
                "34．大壮卦： dà zhuàng； 35．晋卦： jìn； 36．明夷卦： míng yí；\n" +
                "\n" +
                "37．家人卦： jiā rén； 38．睽卦： kuí； 39．蹇卦： jiǎn；\n" +
                "\n" +
                "40．解卦： xiè； 41．损卦： sǔn； 42．益卦： yì；\n" +
                "\n" +
                "43．夬卦： guài； 44．姤卦： gòu； 45．萃卦： cuì；\n" +
                "\n" +
                "46．升卦： shēng； 47．困卦： kùn； 48．井卦： jǐng；\n" +
                "\n" +
                "49．革卦： gé； 50．鼎卦： dǐng； 51．震卦： zhèn；\n" +
                "\n" +
                "52．艮卦： gèn； 53．渐卦： jiàn； 54．归妹卦： guī mèi；\n" +
                "\n" +
                "55．丰卦： fēng； 56．旅卦： lǚ； 57．巽卦： xùn；\n" +
                "\n" +
                "58．兑卦： duì； 59．涣卦： huàn； 60．节卦： jié；\n" +
                "\n" +
                "61．中孚卦： zhōng fú； 62．小过卦： xiǎo guò； \n" +
                "\n" +
                "63．既济卦： jì jì； 64．未济卦： wèi jì。"

        //八卦详解
        tv_info_bagua_xiangjie.text ="卦名：乾\n" +
                "卦象：天\n" +
                "人物：老父、上司、长辈、王帝、领袖\n" +
                "天气：晴天、乾旱\n" +
                "身体：头、脑、骨髓\n" +
                "方位：西北\n" +
                "数字：一\n" +
                "五行：金\n" +
                "场所：首都、大郡、大广场\n" +
                "其他：精神意识、圆形、刚健、果决、红色\n" +
                "\n" +
                "卦名：兑\n" +
                "卦象：泽\n" +
                "人物：少女、收银员、出纳员、播音员、歌星\n" +
                "天气：多云、梅雨\n" +
                "身体：口、齿、舌\n" +
                "方位：西\n" +
                "数字：二\n" +
                "五行：金\n" +
                "场所：食肆、卡拉OK、银行、水边、洞穴\n" +
                "其他：喜悦、不完整的、金属、乐器、白色\n" +
                "\n" +
                "卦名：离\n" +
                "卦象：火\n" +
                "人物：中女、文人、军人\n" +
                "天气：阳光普照、闪电\n" +
                "身体：眼睛、心脏\n" +
                "方位：南\n" +
                "数字：三\n" +
                "五行：火\n" +
                "场所：图书馆、法院、美容院、学校、灯塔\n" +
                "其他：文明、发光的、外表美丽的、紫色\n" +
                "\n" +
                "卦名：震\n" +
                "卦象：雷\n" +
                "人物：长男\n" +
                "天气：行雷、地震\n" +
                "身体：脚、肝脏、头发、声音\n" +
                "方位：东\n" +
                "数字：四\n" +
                "五行：木\n" +
                "场所：树林、闹市、大街、发电厂\n" +
                "其他：有核的、木器、惊恐、发怒、碧绿色\n" +
                "\n" +
                "卦名：巽\n" +
                "卦象：风\n" +
                "人物：长女、秀士、寡妇、僧人\n" +
                "天气：刮风\n" +
                "身体：呼吸系统、股\n" +
                "方位：东南\n" +
                "数字：五\n" +
                "五行：木\n" +
                "场所：直路、机场、海港、邮局、草木茂盛之地\n" +
                "其他：流动不定、木制工艺品、长而直的、青绿色\n" +
                "\n" +
                "卦名：坎\n" +
                "卦象：水\n" +
                "人物：中男、渔民、江湖人物、盗贼\n" +
                "天气：下雨、下雪、霜露、月\n" +
                "身体：耳朵、血液、肾脏\n" +
                "方位：北\n" +
                "数字：六\n" +
                "五行：水\n" +
                "场所：有水的地方、酒楼、酒吧、酒店、井\n" +
                "其他：含有水的东西、下陷的地方、黑色\n" +
                "\n" +
                "\n" +
                "卦名：艮\n" +
                "卦象：山\n" +
                "人物：少男、童子\n" +
                "天气：云雾\n" +
                "身体：手指、鼻子、背部\n" +
                "方位：东北\n" +
                "数字：七\n" +
                "五行：土\n" +
                "场所：与山有关的地方、门口、墓地\n" +
                "其他：阻隔停顿、不动之物、黄色\n" +
                "\n" +
                "卦名：坤\n" +
                "卦象：地\n" +
                "人物：老母、孕妇、妻子、众人\n" +
                "天气：阴云、雾气\n" +
                "身体：腹部、脾胃、皮肤\n" +
                "方位：西南\n" +
                "数字：八\n" +
                "五行：土\n" +
                "场所：田野、平地、平原\n" +
                "其他：柔顺、方形、众多的、布类、黄色"

        val layoutParams = iv_fengong.layoutParams
        val imageWidth = layoutParams.width;
        val imageHeight = imageWidth * 939 / 708

        Glide.with(iv_fengong.context)
            .load(R.drawable.fengong2)
            .fitCenter()
            .override(imageWidth,imageHeight)
            .into(iv_fengong)

        tv_info_shuyu_cuogua.text = "本卦：又叫主卦、原卦。它体现的是事物初始、开始阶段的信息，或目前的情况。\n" +
                "\n" +
                "互卦：是由本卦的两个内卦组合而成的。具体组合方法是：本卦中的第三、四、五爻，拿出来作为互卦的上卦，本卦的第二、三、四爻，拿出来作为互卦的下卦。上卦、下卦组合在一起，就得到了互卦。互卦为事情发展的过程。\n" +
                "\n" +
                "错卦：是与本卦阴阳全颠倒的卦，即每个爻阴变阳、阳变阴而得到的卦。错卦是一种从反面的角度。\n" +
                "\n" +
                "综卦：就是把本卦倒过来看。它们通常是从事物的反面来看事物的发展变化。综卦是从另外一种角度来思考要测的事情。\n" +
                "\n" +
                "变卦：是由本卦经过某个爻的变动、变化而得到的，也就是变卦是由本卦变动而来的。变卦代表着事物发展变化的最终结果，也就是求测者想要得到的最终结果、结局。在预测时，事物的最终吉凶结果，要由变卦来作最后定夺。所以，预测最终要以变的结果为准。变卦为事情发展的结果。\n" +
                "\n" +
                "同卦：上卦和下卦相同，共8个。上卦和下卦也称单卦\n" +
                "\n" +
                "异卦：上卦和下卦不同。\n" +
                "\n" +
                "经卦：八卦中的卦叫经卦，意味八个经卦如经纬两两交织组成64个别卦。64个别卦代表事物双方相互关系的64个类别。分别是：乾、兑、离、震、巽、坎、艮、坤。\n" +
                "\n" +
                "别卦：六十四卦中的每一个卦叫“别卦”，“别”指类别。一个“别卦”展示的是主客双方关系形势下各种变化的可能性。\n" +
                "\n" +
                "主卦与客卦：八卦下部三条爻是主卦，代表主方；上部三条爻是客卦，代表客方。爻的顺序由下而上。卦爻辞中有“我”，表明别卦代表主客双方关系，“我”就是指主方。从周文王演易，可知必定有一方代表周文王，另一方代表商纣王，有主方和客方，别卦下部是主卦，代表主方；上部是客卦，代表客方。\n" +
                "\n"
    }
}